Repository: raumschiff-werkstatt-fur-astronomie/goesflarewatch
Catalog: docs/locales/*/LC_MESSAGES/source/green_breadboard.po
Languages: de

source: Instructions for the building the green version
de: Anleitung zum Bau der grünen Version

source: This is very similar to the instructions for the white breadboard
de: Dies ist der Anleitung für das weisse Steckbrett sehr ähnlich

source: You will need:
de: Sie benötigen:

source: A table tennis ball
de: Ein Tischtennisball

source: One green breadboard
de: Ein grünes Steckbrett

source: Wires
de: Drähte

source: Soldering material
de: Lötmaterial

source: One LED with LED plastic holder
de: Eine LED mit LED-Kunststoffhalter

source: Three wire holder
de: Dreidrahthalter

source: One ESP32 development board
de: Ein ESP32-Entwicklungsboard

source: One 110 Ohm resistor
de: Ein 110-Ohm-Widerstand

source: How to proceed:
de: So gehen Sie vor:

source: Take the tennis ball and carefully create a small hole in it, ensuring it’s not too large but sufficient to mount the LED holder. To achieve this, I use a fine awl to start the hole and then gently enlarge it with precision pliers.#. Connect a wire at each end of the LED
de: Nehmen Sie den Tennisball und bohren Sie vorsichtig ein kleines Loch hinein. Achten Sie darauf, dass es nicht zu gross, aber ausreichend ist, um den LED-Halter zu montieren. Um dies zu erreichen, beginne ich das Loch mit einer feinen Ahle und vergrössere es dann vorsichtig mit einer Präzisionszange.#. Schliessen Sie an jedem Ende der LED einen Draht an

source: Mount the LED holder into the hole of the tennis ball
de: Befestigen Sie den LED-Halter im Loch des Tennisballs

source: Now, assemble the wire holder, ensuring that one end of each wire is connected to the LED. Take care to note that the longer “leg” of the LED should be connected to the ground.#. Solder the wire holder on the breadboard
de: Montieren Sie nun den Kabelhalter und achten Sie darauf, dass ein Ende jedes Kabels mit der LED verbunden ist. Achten Sie darauf, dass das längere „Bein“ der LED mit der Masse verbunden werden sollte.# Löten Sie den Drahthalter auf das Steckbrett

source: Take the ESP32 and look at the pin. Locate the pin number 27
de: Nehmen Sie den ESP32 und schauen Sie sich den Pin an. Suchen Sie die Pin-Nummer 27

source: Solder the two wire holders on the breadboard such that they can accommodate the dev board later
de: Löten Sie die beiden Drahthalter so auf das Steckbrett, dass sie später das Entwicklungsboard aufnehmen können

source: Solder a wire from the ground to the ground line of the breadboard
de: Löten Sie einen Draht von der Masse zur Masseleitung des Steckbretts

source: Solder the resistor at a free space of the breadboard
de: Löten Sie den Widerstand an einer freien Stelle des Steckbretts an

source: Solder a wire from the pin 27 of the processor to the resistor
de: Löten Sie einen Draht vom Pin 27 des Prozessors an den Widerstand

source: Solder a wire from the resistor to the one side of the wire holder
de: Löten Sie einen Draht vom Widerstand an die eine Seite des Drahthalters

source: Solder a wire from the ground pin of the dev board to the other side of the wire holder
de: Löten Sie einen Draht vom Erdungsstift der Entwicklungsplatine auf die andere Seite des Drahthalters

source: Plug it in and test it with Thonny, see also `Usage`__ or continue reading
de: Schliessen Sie es an und testen Sie es mit Thonny, siehe auch „Verwendung“__ oder lesen Sie weiter
