Repository: raumschiff-werkstatt-fur-astronomie/goesflarewatch
Catalog: docs/locales/*/LC_MESSAGES/source/project_overview.po
Languages: de

source: Overview of the System
de: Überblick über das System

source: Solar Flare Alert is a set of applications designed to monitor the Sun's activity using various hardware backends, including the **ESP32 microprocessor**, which controls diverse LEDs. This system fetches real-time data from the **GOES spacecraft** and processes it to dynamically adjust the LEDs, either through brightness or color changes, visually representing solar activity.
de: Solar Flare Alert ist eine Reihe von Anwendungen zur Überwachung der Sonnenaktivität mithilfe verschiedener Hardware-Backends, einschließlich des **ESP32-Mikroprozessors**, der verschiedene LEDs steuert. Dieses System ruft Echtzeitdaten vom **GOES-Raumschiff** ab und verarbeitet sie, um die LEDs dynamisch anzupassen, entweder durch Helligkeits- oder Farbänderungen, und so die Sonnenaktivität visuell darzustellen.

source: The system uses the **GOES spacecraft** data to fetch the solar activity levels, and it controls the LED(s) based on this data. The two main front-end versions currently implemented are:
de: Das System nutzt die Daten der **GOES-Raumsonde**, um die Sonnenaktivitätsniveaus abzurufen, und steuert die LED(s) auf Grundlage dieser Daten. Die beiden derzeit implementierten Haupt-Frontend-Versionen sind:

source: **Single LED Version**: A single LED gradually brightens with increasing solar activity. It blinks when a flare larger than the M-class occurs, and the blinking speeds up for X-class flares.
de: **Einzel-LED-Version**: Eine einzelne LED wird mit zunehmender Sonnenaktivität allmählich heller. Es blinkt, wenn eine Fackel auftritt, die größer als die M-Klasse ist, und das Blinken wird bei Fackeln der X-Klasse beschleunigt.

source: **LED Strip Version**: An LED strip that varies in color according to the intensity of solar activity.
de: **LED-Streifenversion**: Ein LED-Streifen, dessen Farbe je nach Intensität der Sonnenaktivität variiert.

source: The project uses **Micropython**, specifically running on the **ESP32**, which is very efficient as it requires no external processing (e.g., Jupyter notebooks). You can install **Micropython** directly onto the ESP32, download the necessary files, and get started right away. Check out `<esp32.html>`_.
de: Das Projekt verwendet **Micropython**, insbesondere läuft es auf dem **ESP32**, was sehr effizient ist, da keine externe Verarbeitung (z. B. Jupyter-Notebooks) erforderlich ist. Sie können **Micropython** direkt auf dem ESP32 installieren, die erforderlichen Dateien herunterladen und sofort loslegen. Schauen Sie sich „<esp32.html>“_ an.

source: While there is a **Python version** of the code for Arduino (which is now deprecated), it involves using a Jupyter notebook to fetch the data from the GOES spacecraft, process it, and send it to an Arduino via the serial port. The Arduino then controls the LEDs based on the received values.
de: Es gibt zwar eine **Python-Version** des Codes für Arduino (die mittlerweile veraltet ist), aber sie erfordert die Verwendung eines Jupyter-Notebooks, um die Daten vom GOES-Raumschiff abzurufen, zu verarbeiten und über die serielle Schnittstelle an ein Arduino zu senden. Der Arduino steuert dann die LEDs anhand der empfangenen Werte.

source: A **Raspberry Pi** version is still under development.
de: Eine **Raspberry Pi**-Version befindet sich noch in der Entwicklung.

source: All these programs are continuously updated as part of the tinkering nature of the project, and contributions are always welcome.
de: Alle diese Programme werden im Rahmen des Bastelcharakters des Projekts kontinuierlich aktualisiert und Beiträge sind immer willkommen.

source: A Note About Updates
de: Ein Hinweis zu Updates

source: We are continually updating these programs, as this project is always evolving. It's a tinkering project, and we encourage everyone to contribute!
de: Wir aktualisieren diese Programme ständig, da sich dieses Projekt ständig weiterentwickelt. Es ist ein Bastelprojekt und wir ermutigen jeden, seinen Beitrag zu leisten!
