Repository: raumschiff-werkstatt-fur-astronomie/goesflarewatch
Catalog: docs/locales/*/LC_MESSAGES/mp_install_esp32.po
Languages: de

source: How to install the solar flare alert software on the ESP32 board
de: So installieren Sie die Software zur Warnung vor Sonneneruptionen auf dem ESP32-Board

source: Flashing MicroPython to ESP32
de: MicroPython auf ESP32 flashen

source: The ESP32 development board is available at various places, such as `Bastelgarage <https://www.bastelgarage.ch/nodemcu-32s-esp32-wifi-bluetooth-entwicklungs-board?search=wroom>`_, where you can easily find one near you.
de: Das ESP32-Entwicklungsboard ist an verschiedenen Orten erhältlich, beispielsweise in „Bastelgarage <https://www.bastelgarage.ch/nodemcu-32s-esp32-wifi-bluetooth-entwicklungs-board?search=wroom>“, wo Sie ganz einfach eines in Ihrer Nähe finden können.

source: Install ``esptool`` either using ``pip install esptool`` or trough your package manager on Linux
de: Installieren Sie „esptool“ entweder mit „pip install esptool“ oder über Ihren Paketmanager unter Linux

source: Download the recent firmware from http://micropython.org/download#esp32
de: Laden Sie die aktuelle Firmware von http://micropython.org/download#esp32 herunter

source: From the folder were you downloaded the firmware run ``esptool.py --chip esp32 --port /dev/ttyUSB0 erase_flash`` to erase the flash
de: Führen Sie aus dem Ordner, in den Sie die Firmware heruntergeladen haben, „esptool.py --chip esp32 --port /dev/ttyUSB0 erase_flash“ aus, um den Flash zu löschen

source: Run ``esptool.py --chip esp32 --port /dev/ttyUSB0 --baud 460800 write_flash -z 0x1000 <DOWNLOADED_FIRMWARE>.bin`` to flash it. But read remark below.
de: Führen Sie „esptool.py --chip esp32 --port /dev/ttyUSB0 --baud 460800 write_flash -z 0x1000 <DOWNLOADED_FIRMWARE>.bin“ aus, um es zu flashen. Aber lesen Sie den Kommentar unten.

source: Open a serial terminal (screen, putty, picocom) to check if you get a python shell.
de: Öffnen Sie ein serielles Terminal (Screen, Putty, Picocom), um zu prüfen, ob Sie eine Python-Shell erhalten.

source: On Mac:
de: Auf dem Mac:

source: Mac doesnt know ``pip``, so you should use ``brew`` instead.
de: Mac kennt „pip“ nicht, daher sollten Sie stattdessen „brew“ verwenden.

source: The port where the ESP is attached may vary depending on the computer you are using. For instance, on an M1 I get /dev/cu.usbserial-0001. How to find out? You can do this by starting Thonny and hopefully it will find it automatically. On Mac, it might require an additional driver. If you dont see the device, this might be due to a wrong cable. -- my personal experience. Try another cable. One way is to open thonny and read the port on the lower right of the window.
de: Der Port, an dem das ESP angeschlossen ist, kann je nach verwendetem Computer variieren. Auf einem M1 erhalte ich beispielsweise /dev/cu.usbserial-0001. Wie finde ich das heraus? Sie können dies tun, indem Sie Thonny starten und hoffentlich wird es automatisch gefunden. Auf dem Mac ist möglicherweise ein zusätzlicher Treiber erforderlich. Wenn Sie das Gerät nicht sehen, liegt das möglicherweise an einem falschen Kabel. – meine persönliche Erfahrung. Versuchen Sie es mit einem anderen Kabel. Eine Möglichkeit besteht darin, Thonny zu öffnen und den Port unten rechts im Fenster zu lesen.

source: See https://docs.micropython.org/en/latest/esp32/quickref.html
de: Siehe https://docs.micropython.org/en/latest/esp32/quickref.html

source: Installing Thonny
de: Thonny installieren

source: Thonny is a simple IDE for Python, MicroPython and CircuitPython (Adafruits MicroPython fork), it allows to upload your programs to a MicroPython board easily, also when it doesn't show up as a USB drive.
de: Thonny ist eine einfache IDE für Python, MicroPython und CircuitPython (Adafruits MicroPython-Fork). Sie ermöglicht das einfache Hochladen Ihrer Programme auf ein MicroPython-Board, auch wenn es nicht als USB-Laufwerk angezeigt wird.

source: To install it, the go to https://thonny.org/
de: Um es zu installieren, gehen Sie zu https://thonny.org/

source: See https://randomnerdtutorials.com/getting-started-thonny-micropython-python-ide-esp32-esp8266/
de: Siehe https://randomnerdtutorials.com/getting-started-thonny-micropython-python-ide-esp32-esp8266/

source: Upload code
de: Code hochladen

source: All the code for this project is on GitHub. It's a bit a mess, but for the micropython you should look at the corresponding directory.
de: Der gesamte Code für dieses Projekt ist auf GitHub. Es ist ein bisschen chaotisch, aber für den Micropython sollte man sich das entsprechende Verzeichnis ansehen.

source: There are three files needed,`solar_flare_alert.py`, `libs/micropython-wifi_manager/wifi_manager.py`, and `rainbow2.py`
de: Es werden drei Dateien benötigt: „solar_flare_alert.py“, „libs/micropython-wifi_manager/wifi_manager.py“ und „rainbow2.py“.

source: You can open them in Thonny.
de: Sie können sie in Thonny öffnen.

source: In `solar_flare_alert.py`, check if the options are correct, especially if the \ LED pins are correct, the pin names on ESPs are a bit weird from time to time.
de: Überprüfen Sie in „solar_flare_alert.py“, ob die Optionen korrekt sind, insbesondere ob die LED-Pins korrekt sind. Die Pin-Namen auf ESPs sind von Zeit zu Zeit etwas seltsam.

source: In the file boot.py, which should already be on the board, change the line `import main` to `import solar_flare_alert` if it is there, or else just add the line `import solar_flare_alert`. This will make sure that the program starts automatically when the board is powered.
de: Ändern Sie in der Datei boot.py, die sich bereits auf der Platine befinden sollte, die Zeile „import main“ in „import solar_flare_alert“, falls vorhanden, oder fügen Sie einfach die Zeile „import solar_flare_alert“ hinzu. Dadurch wird sichergestellt, dass das Programm automatisch startet, wenn das Board mit Strom versorgt wird.

source: On the esp32 board, you will see that the files are already there. You can of course work on those ones too. They might be outdated though, so you can decide whatever is best for you. If you want to contribute and submit them to GitHub you *have to* use the latest ones.
de: Auf dem esp32-Board sehen Sie, dass die Dateien bereits vorhanden sind. Natürlich können Sie auch daran arbeiten. Möglicherweise sind sie jedoch veraltet, sodass Sie entscheiden können, was für Sie am besten ist. Wenn Sie einen Beitrag leisten und diese an GitHub übermitteln möchten, *müssen* Sie die neuesten Versionen verwenden.

source: Saving files from Thonny to the esp32 board, you do not need to make subfolders there, you can save everything in the main folder.
de: Wenn Sie Dateien von Thonny auf dem esp32-Board speichern, müssen Sie dort keine Unterordner erstellen, sondern können alles im Hauptordner speichern.

source: Wiring
de: Verdrahtung

source: On our board the pins are labeled with **IOxx** so it is pretty straight forward. The pins deliver 3.3V and some sources say max 12mA, we use a 110 Ohm resistor.
de: Auf unserem Board sind die Pins mit **IOxx** beschriftet, sodass es ziemlich einfach ist. Die Pins liefern 3,3 V und einige Quellen sagen maximal 12 mA, wir verwenden einen 110-Ohm-Widerstand.

source: Testing
de: Testen

source: In `solar_flare_alert.py` set RUN to False, the program loop wont run and you can test the functions. For example if the LED lights up correctly.
de: Setzen Sie in „solar_flare_alert.py“ RUN auf False, die Programmschleife wird nicht ausgeführt und Sie können die Funktionen testen. Zum Beispiel, ob die LED richtig leuchtet.
